trainning/101programming/codeStream_BC/waveTank/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
/*
    left
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        redirectType    solitary_wave_velocity;

        code
        #{
            const scalar d = 5.;
            const scalar H = 2.;

            const scalar t = this->db().time().timeOutputValue();

            scalar c = sqrt(9.81*d*(1 + H/d));
            scalar x0 = 3/sqrt(3./4.*H/pow(d, 3));
            scalar X = sqrt(3./4.*H/pow(d, 3))*(x0 - c*t);
            scalar sech2 = pow(1./cosh(X), 2);
            scalar u = sqrt(9.81*d)*H/d*sech2;

            vectorField f(patch().size(), vector::zero);

            forAll(patch().Cf(), faceI)
            {
                const scalar y = patch().Cf()[faceI][1];
                const scalar v =
                    sqrt(3.*9.81*d)*pow(H/d, 1.5)*(y/d)*sech2*tanh(X);

                f[faceI] = vector(u, v, 0.);
            }
            operator==(f);
        #};
    }
*/

    left
    {
        type            codedFixedValue;
        value           uniform (0 0 0);
        redirectType    wave_velocity;

        code
        #{
            const fvPatch& boundaryPatch = patch(); 
            const vectorField& Cf = boundaryPatch.Cf(); 
            vectorField& field = *this; 

            field = patchInternalField(); 	//take value from initialization

            const scalar l = 5.;
            const scalar A = 0.1;
            const scalar gs = 9.81;
            const vector gv(0.,9.81,0);

            const scalar t = this->db().time().timeOutputValue();

            scalar k = 2.0*3.14159/l;
            scalar w = sqrt(k*mag(gv));

            forAll(Cf, faceI)
            {
                const scalar y = Cf[faceI].y();

                if (y <= A*cos(-w*t)+0.5*k*A*A*cos(2*(-w*t)) )
                {
                    field[faceI] = vector(A*w*exp(k*y)*cos(-w*t), A*w*exp(k*y)*sin(-w*t), 0);
                }
            }
        #};
    }

    right
    {
        //type            fixedValue;
        //value           uniform (0 0 0);

        type            zeroGradient;
    }

    top
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    bottom
    {
        //type            fixedValue;
        //value           uniform (0 0 0);

	type		slip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
